lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
#include <Arduino.h>
#include <string.h>

#include "nrf54l15_hal.h"
#include "zigbee_commissioning.h"
#include "zigbee_security.h"
#include "zigbee_stack.h"

#if defined(NRF54L15_CLEAN_ZIGBEE_ENABLED) && (NRF54L15_CLEAN_ZIGBEE_ENABLED == 0)
#error "Enable Tools > Zigbee Support to build ZigbeeHaCoordinatorJoinDemo."
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_CHANNEL
#define NRF54L15_CLEAN_ZIGBEE_CHANNEL 15
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_PAN_ID 0x1234
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY
#define NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_COORDINATOR_IEEE
#define NRF54L15_CLEAN_ZIGBEE_COORDINATOR_IEEE 0x00124B000054A11FULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_EXTENDED_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_EXTENDED_PAN_ID 0x00124B000054C0DEULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_IEEE
#define NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_IEEE 0x00124B0001AC1001ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_INSTALL_CODE_BYTES                    \
  0x10U, 0xACU, 0x01U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xA1U, 0xB2U, 0xC3U, 0xD4U, \
      0xE5U, 0xF6U, 0x07U, 0x18U, 0x29U, 0x43U, 0x6AU
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_IEEE
#define NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_IEEE 0x00124B0001AC1002ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_INSTALL_CODE_BYTES                 \
  0x10U, 0xACU, 0x02U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xAAU, 0xBBU, 0xCCU, 0xDDU, \
      0xEEU, 0xFFU, 0x11U, 0x22U, 0x33U, 0xFEU, 0xC9U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_IEEE
#define NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_IEEE 0x00124B0001AC2001ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_INSTALL_CODE_BYTES             \
  0x10U, 0xACU, 0x03U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xCAU, 0xFEU, 0xBAU, 0xBEU, \
      0x10U, 0x21U, 0x32U, 0x43U, 0x54U, 0xDCU, 0xB9U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_RGB_MOOD_LIGHT_IEEE
#define NRF54L15_CLEAN_ZIGBEE_RGB_MOOD_LIGHT_IEEE 0xA4B1000000000021ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_RGB_MOOD_LIGHT_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_RGB_MOOD_LIGHT_INSTALL_CODE_BYTES                 \
  0x10U, 0xACU, 0x21U, 0x01U, 0x24U, 0x4BU, 0x00U, 0x12U, 0x34U, 0x56U, 0x78U, \
      0x9AU, 0xBCU, 0xDEU, 0xF0U, 0x11U, 0x06U, 0x4DU
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_RGBW_CEILING_LIGHT_IEEE
#define NRF54L15_CLEAN_ZIGBEE_RGBW_CEILING_LIGHT_IEEE 0xA4B1000000000022ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_RGBW_CEILING_LIGHT_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_RGBW_CEILING_LIGHT_INSTALL_CODE_BYTES             \
  0x10U, 0xACU, 0x22U, 0x01U, 0x24U, 0x4BU, 0x00U, 0x22U, 0x44U, 0x66U, 0x88U, \
      0xAAU, 0xCCU, 0xEEU, 0x10U, 0x32U, 0x3FU, 0xAAU
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_HUMIDITY_SENSOR_IEEE
#define NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_HUMIDITY_SENSOR_IEEE 0xA4B1000000000031ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_HUMIDITY_SENSOR_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_HUMIDITY_SENSOR_INSTALL_CODE_BYTES    \
  0x10U, 0xACU, 0x31U, 0x01U, 0x24U, 0x4BU, 0x00U, 0x31U, 0x53U, 0x75U, 0x97U, \
      0xB9U, 0xDBU, 0xFDU, 0x1FU, 0x41U, 0x84U, 0xE6U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_CLIMATE_BATTERY_SENSOR_IEEE
#define NRF54L15_CLEAN_ZIGBEE_CLIMATE_BATTERY_SENSOR_IEEE 0xA4B1000000000032ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_CLIMATE_BATTERY_SENSOR_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_CLIMATE_BATTERY_SENSOR_INSTALL_CODE_BYTES         \
  0x10U, 0xACU, 0x32U, 0x01U, 0x24U, 0x4BU, 0x00U, 0x42U, 0x54U, 0x66U, 0x78U, \
      0x8AU, 0x9CU, 0xAEU, 0xC0U, 0xD2U, 0xADU, 0xFDU
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_15S_IEEE
#define NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_15S_IEEE 0xA4B1000000000041ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_15S_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_15S_INSTALL_CODE_BYTES      \
  0x10U, 0xACU, 0x41U, 0x01U, 0x24U, 0x4BU, 0x00U, 0x14U, 0x28U, 0x3CU, 0x50U, \
      0x64U, 0x78U, 0x8CU, 0xA0U, 0xB4U, 0x19U, 0x26U
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_60S_IEEE
#define NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_60S_IEEE 0xA4B1000000000042ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_60S_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_60S_INSTALL_CODE_BYTES      \
  0x10U, 0xACU, 0x42U, 0x01U, 0x24U, 0x4BU, 0x00U, 0x24U, 0x48U, 0x6CU, 0x90U, \
      0xB4U, 0xD8U, 0xFCU, 0x20U, 0x44U, 0xA6U, 0xADU
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SLEEPY_ONOFF_BUTTON_IEEE
#define NRF54L15_CLEAN_ZIGBEE_SLEEPY_ONOFF_BUTTON_IEEE 0xA4B1000000000051ULL
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_SLEEPY_ONOFF_BUTTON_INSTALL_CODE_BYTES
#define NRF54L15_CLEAN_ZIGBEE_SLEEPY_ONOFF_BUTTON_INSTALL_CODE_BYTES            \
  0x10U, 0xACU, 0x51U, 0x01U, 0x24U, 0x4BU, 0x00U, 0x57U, 0x68U, 0x79U, 0x8AU, \
      0x9BU, 0xACU, 0xBDU, 0xCEU, 0xDFU, 0x1FU, 0x7FU
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN
#define NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_TX_DEBUG
#define NRF54L15_CLEAN_ZIGBEE_TX_DEBUG 0
#endif

using namespace xiao_nrf54l15;

namespace {

static ZigbeeRadio g_radio;
static uint8_t g_macSequence = 1U;
static uint8_t g_nwkSequence = 1U;
static uint32_t g_nwkSecurityFrameCounter = 1U;
static uint32_t g_apsTrustCenterFrameCounter = 1U;
static uint8_t g_apsCounter = 1U;
static uint8_t g_zclSequence = 1U;
static uint8_t g_zdoSequence = 1U;
static uint32_t g_lastBeaconMs = 0U;
static uint32_t g_lastStatusMs = 0U;
static uint32_t g_permitJoinDeadlineMs = 0U;
static bool g_permitJoinEnabled = true;

static constexpr uint8_t kChannel =
    static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_CHANNEL);
static constexpr uint16_t kPanId =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_PAN_ID);
static constexpr uint16_t kCoordinatorShort = 0x0000U;
static constexpr uint8_t kCoordinatorEndpoint = 1U;
static constexpr uint64_t kCoordinatorIeee =
    static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_COORDINATOR_IEEE);
static constexpr uint64_t kExtendedPanId =
    static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_EXTENDED_PAN_ID);
static uint8_t g_activeNetworkKeySequence = 0x01U;
static uint8_t g_activeNetworkKey[16] = {0xA1U, 0xB2U, 0xC3U, 0xD4U,
                                         0xE5U, 0xF6U, 0x07U, 0x18U,
                                         0x29U, 0x3AU, 0x4BU, 0x5CU,
                                         0x6DU, 0x7EU, 0x8FU, 0x90U};
static uint8_t g_alternateNetworkKeySequence = 0U;
static uint8_t g_alternateNetworkKey[16] = {0U};
static bool g_haveAlternateNetworkKey = false;

#if NRF54L15_CLEAN_ZIGBEE_TX_DEBUG != 0
void printLastRadioTransmitDebug(const char* prefix) {
  const ZigbeeTransmitDebug debug = g_radio.lastTransmitDebug();
  Serial.print(prefix);
  Serial.print(" tx_len=");
  Serial.print(debug.txLength);
  Serial.print(" end=");
  Serial.print(debug.endSeen ? "yes" : "no");
  Serial.print(" disabled=");
  Serial.print(debug.disabledSeen ? "yes" : "no");
  Serial.print(" ack_req=");
  Serial.print(debug.ackRequested ? "yes" : "no");
  Serial.print(" ack_rx=");
  Serial.print(debug.ackReceived ? "yes" : "no");
  Serial.print(" ack_seq=0x");
  Serial.print(debug.ackSequence, HEX);
  Serial.print(" rx_len=");
  Serial.print(debug.rxLength);
  Serial.print(" rx_seq=0x");
  Serial.print(debug.rxSequence, HEX);
  Serial.print("\r\n");
}
#endif
static constexpr uint8_t kMaxNodes = 8U;
static constexpr uint8_t kPendingPayloadMax = 96U;
static constexpr uint8_t kZclCommandWriteAttributesResponse = 0x04U;
static constexpr uint8_t kZclCommandConfigureReportingResponse = 0x07U;
static constexpr uint8_t kZclCommandReadReportingConfigurationResponse = 0x09U;
static constexpr uint8_t kZclCommandReportAttributes = 0x0AU;
static constexpr uint8_t kZclCommandDefaultResponse = 0x0BU;
static constexpr uint8_t kZclCommandDiscoverAttributesExtendedResponse = 0x16U;
static constexpr uint8_t kOnOffCommandOff = 0x00U;
static constexpr uint8_t kOnOffCommandOn = 0x01U;
static constexpr uint8_t kOnOffCommandToggle = 0x02U;
static constexpr uint8_t kIdentifyCommandIdentify = 0x00U;
static constexpr uint8_t kIdentifyCommandIdentifyQuery = 0x01U;
static constexpr uint8_t kIdentifyCommandTriggerEffect = 0x40U;
static constexpr uint8_t kIdentifyEffectBlink = 0x00U;
static constexpr uint8_t kIdentifyEffectBreathe = 0x01U;
static constexpr uint8_t kIdentifyEffectChannelChange = 0x0BU;
static constexpr uint8_t kIdentifyEffectStopEffect = 0xFFU;
static constexpr uint8_t kGroupsCommandAddGroup = 0x00U;
static constexpr uint8_t kLevelControlCommandMoveToLevelWithOnOff = 0x04U;
static constexpr uint8_t kLevelControlCommandStepWithOnOff = 0x06U;
static constexpr uint8_t kColorControlCommandMoveToHue = 0x00U;
static constexpr uint8_t kColorControlCommandMoveToSaturation = 0x03U;
static constexpr uint8_t kColorControlCommandMoveToHueAndSaturation = 0x06U;
static constexpr uint8_t kColorControlCommandMoveToColorTemperature = 0x0AU;
static constexpr uint16_t kDemoGroupId = 0x1001U;
static constexpr uint32_t kPermitJoinWindowMs = 120000UL;
static constexpr uint32_t kRouterDirectDeliverRetryMs = 40UL;
static constexpr uint32_t kRouterPostAssocDeliverDelayUs = 6000UL;

struct PreconfiguredNodePolicy {
  uint64_t ieeeAddress;
  uint8_t installCode[18];
};

