lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool sendApsFrameExtendedWithCounter(uint16_t destinationShort,
                                     uint8_t deliveryMode,
                                     uint16_t destinationGroup,
                                     uint8_t destinationEndpoint,
                                     uint16_t clusterId, uint16_t profileId,
                                     uint8_t sourceEndpoint,
                                     const uint8_t* payload,
                                     uint8_t payloadLength, uint8_t apsCounter,
                                     bool trackAck);
bool buildTransportKeyPsdu(NodeEntry* node, uint8_t* outPsdu,
                           uint8_t* outPsduLength, uint8_t* outKeySequence,
                           bool* outNwkSecurityEnabled);
bool buildUpdateDevicePsdu(NodeEntry* node, uint8_t* outPsdu,
                           uint8_t* outPsduLength);
bool sendPendingApsFrame(NodeEntry* node);
bool nodeUsesParentPolling(const NodeEntry& node);
bool maybeDeliverPendingDirect(NodeEntry* node, uint32_t nowMs,
                               bool immediateAfterAssoc = false);
bool queueNextReportingStep(NodeEntry* node);

static NodeEntry g_nodes[kMaxNodes] = {};
static uint16_t g_nextShortAddress = 0x1000U;

NodeEntry* findNodeByIeee(uint64_t ieeeAddress) {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].ieeeAddress == ieeeAddress) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* findNodeByShort(uint16_t shortAddress) {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress == shortAddress) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* findNodeForDataRequest(const ZigbeeMacFrame& frame) {
  if (frame.source.mode == ZigbeeMacAddressMode::kExtended) {
    return findNodeByIeee(frame.source.extendedAddress);
  }

  if (frame.source.mode == ZigbeeMacAddressMode::kShort) {
    return findNodeByShort(frame.source.shortAddress);
  }

  return nullptr;
}

NodeEntry* allocateNode(uint64_t ieeeAddress) {
  NodeEntry* existing = findNodeByIeee(ieeeAddress);
  if (existing != nullptr) {
    return existing;
  }

  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used) {
      memset(&g_nodes[i], 0, sizeof(g_nodes[i]));
      g_nodes[i].used = true;
      g_nodes[i].ieeeAddress = ieeeAddress;
      return &g_nodes[i];
    }
  }
  return nullptr;
}

uint16_t allocateShortAddress() {
  while (findNodeByShort(g_nextShortAddress) != nullptr ||
         g_nextShortAddress == 0x0000U || g_nextShortAddress == 0xFFFFU) {
    ++g_nextShortAddress;
  }
  return g_nextShortAddress++;
}

const char* nodeStageName(NodeStage stage) {
  switch (stage) {
    case NodeStage::kIdle:
      return "idle";
    case NodeStage::kAwaitingNodeDescriptor:
      return "node_desc";
    case NodeStage::kAwaitingPowerDescriptor:
      return "power_desc";
    case NodeStage::kAwaitingActiveEndpoints:
      return "active_ep";
    case NodeStage::kAwaitingSimpleDescriptor:
      return "simple_desc";
    case NodeStage::kAwaitingBasicRead:
      return "basic_read";
    case NodeStage::kAwaitingReporting:
      return "reporting";
    case NodeStage::kReady:
      return "ready";
  }
  return "unknown";
}

void markInterviewStage(NodeEntry* node, NodeStage stage) {
  if (node == nullptr) {
    return;
  }
  if (node->stage != stage) {
    node->stageRetriesRemaining = kInterviewRetryLimit;
  }
  node->stage = stage;
  node->stageDeadlineMs = millis() + kInterviewRetryDelayMs;
}

const uint8_t* findInstallCodeForNode(uint64_t ieeeAddress) {
  for (uint8_t i = 0U;
       i < static_cast<uint8_t>(sizeof(kPreconfiguredNodePolicies) /
                                sizeof(kPreconfiguredNodePolicies[0]));
       ++i) {
    if (kPreconfiguredNodePolicies[i].ieeeAddress == 0U) {
      continue;
    }
    if (kPreconfiguredNodePolicies[i].ieeeAddress == ieeeAddress) {
      return kPreconfiguredNodePolicies[i].installCode;
    }
  }
  return nullptr;
}

bool resolveTrustCenterLinkKey(NodeEntry* node, uint8_t outKey[16],
                               ZigbeePreconfiguredKeyMode* outMode) {
  if (node == nullptr || outKey == nullptr || outMode == nullptr) {
    return false;
  }

  const uint8_t* installCode = findInstallCodeForNode(node->ieeeAddress);
  if (installCode != nullptr &&
      ZigbeeSecurity::deriveInstallCodeLinkKey(installCode, 18U, outKey)) {
    *outMode = ZigbeePreconfiguredKeyMode::kInstallCodeDerived;
    return true;
  }

#if !NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY
  return false;
#else
  if (!ZigbeeSecurity::loadZigbeeAlliance09LinkKey(outKey)) {
    return false;
  }
  *outMode = ZigbeePreconfiguredKeyMode::kWellKnown;
  return true;
#endif
}

bool secureRejoinAllowed(const NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
#if NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN
  return ZigbeeCommissioning::isUniqueLinkKeyMode(node->preconfiguredKeyMode);
#else
  return node->preconfiguredKeyMode != ZigbeePreconfiguredKeyMode::kNone;
#endif
}

const char* trustCenterStateName(TrustCenterNodeState state) {
  switch (state) {
    case TrustCenterNodeState::kWaitingTransportKey:
      return "waiting_transport_key";
    case TrustCenterNodeState::kJoined:
      return "joined";
    case TrustCenterNodeState::kWaitingUpdateDevice:
      return "waiting_update_device";
    case TrustCenterNodeState::kAlternateKeyStaged:
      return "alternate_key_staged";
    case TrustCenterNodeState::kIdle:
    default:
      return "idle";
  }
}

const uint8_t* keyForSequence(uint8_t keySequence) {
  if (keySequence == g_activeNetworkKeySequence) {
    return g_activeNetworkKey;
  }
  if (g_haveAlternateNetworkKey &&
      keySequence == g_alternateNetworkKeySequence) {
    return g_alternateNetworkKey;
  }
  return nullptr;
}

void clearAlternateNetworkKey() {
  memset(g_alternateNetworkKey, 0, sizeof(g_alternateNetworkKey));
  g_alternateNetworkKeySequence = 0U;
  g_haveAlternateNetworkKey = false;
}

bool deriveAlternateNetworkKey() {
  if (g_haveAlternateNetworkKey) {
    return true;
  }

