lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataAcknowledgement(request, apsFrame,
                                                &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kCoordinatorIeee;
    security.keySequence = keySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

bool sendNwkRejoinResponse(NodeEntry* node, uint8_t status) {
  if (node == nullptr) {
    return false;
  }

  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildNwkRejoinResponseCommand(node->shortAddress, status,
                                                  payload, &payloadLength)) {
    return false;
  }
  return sendNwkCommand(node, payload, payloadLength);
}

bool sendEndDeviceTimeoutResponse(NodeEntry* node, uint8_t status,
                                  uint8_t parentInformation) {
  if (node == nullptr) {
    return false;
  }

  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildNwkEndDeviceTimeoutResponseCommand(
          status, parentInformation, payload, &payloadLength)) {
    return false;
  }
  return sendNwkCommand(node, payload, payloadLength);
}

bool sendTransportKey(NodeEntry* node) {
  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  uint8_t keySequence = 0U;
  bool nwkSecurityEnabled = false;
  if (!buildTransportKeyPsdu(node, psdu, &psduLength, &keySequence,
                             &nwkSecurityEnabled)) {
    return false;
  }

  const bool sent = sendPsdu(psdu, psduLength);
  if (!sent) {
    Serial.print("transport_key FAIL stage=tx short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" psdu_len=");
    Serial.print(psduLength);
    Serial.print("\r\n");
  } else {
    Serial.print("transport_key OK short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" seq=");
    Serial.print(keySequence);
    Serial.print(" nwk_sec=");
    Serial.print(nwkSecurityEnabled ? "yes" : "no");
    Serial.print("\r\n");
  }
  return sent;
}

bool buildTransportKeyPsdu(NodeEntry* node, uint8_t* outPsdu,
                           uint8_t* outPsduLength, uint8_t* outKeySequence,
                           bool* outNwkSecurityEnabled) {
  if (node == nullptr || node->shortAddress == 0U || node->ieeeAddress == 0U) {
    Serial.print("transport_key FAIL stage=invalid_node\r\n");
    return false;
  }
  if (outPsdu == nullptr || outPsduLength == nullptr) {
    return false;
  }
  *outPsduLength = 0U;
  if (outKeySequence != nullptr) {
    *outKeySequence = 0U;
  }
  if (outNwkSecurityEnabled != nullptr) {
    *outNwkSecurityEnabled = false;
  }

  uint8_t linkKey[16] = {0U};
  ZigbeePreconfiguredKeyMode keyMode = ZigbeePreconfiguredKeyMode::kNone;
  if (!resolveTrustCenterLinkKey(node, linkKey, &keyMode)) {
    Serial.print("transport_key FAIL stage=resolve_link_key short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print("\r\n");
    return false;
  }
  node->preconfiguredKeyMode = keyMode;

  ZigbeeApsTransportKey transportKey{};
  transportKey.valid = true;
  transportKey.keyType = kZigbeeApsTransportKeyStandardNetworkKey;
  const bool sendAlternateKey =
      node->pendingNetworkKeyUpdate && g_haveAlternateNetworkKey;
  if ((!sendAlternateKey &&
       node->trustCenterState != TrustCenterNodeState::kWaitingTransportKey) ||
      (sendAlternateKey &&
       (node->trustCenterState != TrustCenterNodeState::kJoined ||
        node->currentNetworkKeySequence == 0U ||
        node->currentNetworkKeySequence == g_alternateNetworkKeySequence))) {
    Serial.print("transport_key FAIL stage=state short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" tc=");
    Serial.print(trustCenterStateName(node->trustCenterState));
    Serial.print(" send_alt=");
    Serial.print(sendAlternateKey ? "yes" : "no");
    Serial.print("\r\n");
    return false;
  }
  const uint8_t keySequence =
      sendAlternateKey ? g_alternateNetworkKeySequence : g_activeNetworkKeySequence;
  if (outKeySequence != nullptr) {
    *outKeySequence = keySequence;
  }
  const uint8_t* keyMaterial =
      sendAlternateKey ? g_alternateNetworkKey : g_activeNetworkKey;
  memcpy(transportKey.key, keyMaterial, sizeof(transportKey.key));
  transportKey.keySequence = keySequence;
  transportKey.destinationIeee = node->ieeeAddress;
  transportKey.sourceIeee = kCoordinatorIeee;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  ZigbeeApsSecurityHeader security{};
  security.valid = true;
  security.securityControl = kZigbeeSecurityControlApsEncMic32;
  security.frameCounter = g_apsTrustCenterFrameCounter++;
  security.sourceIeee = kCoordinatorIeee;
  if (!ZigbeeSecurity::buildSecuredApsTransportKeyCommand(
          transportKey, security, linkKey, g_apsCounter++, apsFrame,
          &apsLength)) {
    Serial.print("transport_key FAIL stage=build_aps short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" mode=");
    Serial.print(static_cast<uint8_t>(keyMode));
    Serial.print("\r\n");
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  const uint8_t nwkKeySequence =
      (node->currentNetworkKeySequence != 0U) ? node->currentNetworkKeySequence
                                              : g_activeNetworkKeySequence;
  const uint8_t* nwkKey = keyForSequence(nwkKeySequence);
  nwk.securityEnabled =
      (node->secureNwkSeen && node->currentNetworkKeySequence != 0U &&
       nwkKey != nullptr);
  if (outNwkSecurityEnabled != nullptr) {
    *outNwkSecurityEnabled = nwk.securityEnabled;
  }
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (nwk.securityEnabled) {
    ZigbeeNwkSecurityHeader nwkSecurity{};
    nwkSecurity.valid = true;
    nwkSecurity.securityControl = kZigbeeSecurityControlNwkEncMic32;
    nwkSecurity.frameCounter = g_nwkSecurityFrameCounter++;
    nwkSecurity.sourceIeee = kCoordinatorIeee;
    nwkSecurity.keySequence = nwkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, nwkSecurity, nwkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      Serial.print("transport_key FAIL stage=build_nwk_secure short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" key_seq=");
      Serial.print(nwkKeySequence);
      Serial.print("\r\n");
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    Serial.print("transport_key FAIL stage=build_nwk_plain short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print("\r\n");
    return false;
  }

  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, outPsdu,
                                        outPsduLength, false)) {
    Serial.print("transport_key FAIL stage=build_mac short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" nwk_len=");
    Serial.print(nwkLength);
    Serial.print("\r\n");
    return false;
  }
  return true;
}

