lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool sendApsFrame(uint16_t destinationShort, uint8_t destinationEndpoint,
                  uint16_t clusterId, uint16_t profileId,
                  uint8_t sourceEndpoint, const uint8_t* payload,
                  uint8_t payloadLength) {
  return sendApsFrameExtended(destinationShort, kZigbeeApsDeliveryUnicast, 0U,
                              destinationEndpoint, clusterId, profileId,
                              sourceEndpoint, payload, payloadLength);
}

bool queuePendingTransportKey(NodeEntry* node, bool networkKeyUpdate = false) {
  if (node == nullptr || node->pendingAssociationResponse ||
      node->pendingTransportKey || node->pendingSwitchKey || node->pending.used) {
    return false;
  }
  if (networkKeyUpdate) {
    if (!g_haveAlternateNetworkKey ||
        node->trustCenterState != TrustCenterNodeState::kJoined ||
        node->currentNetworkKeySequence == 0U ||
        node->currentNetworkKeySequence == g_alternateNetworkKeySequence) {
      return false;
    }
    node->pendingNetworkKeyUpdate = true;
  } else {
    node->pendingNetworkKeyUpdate = false;
    node->trustCenterState = TrustCenterNodeState::kWaitingTransportKey;
  }
  node->pendingTransportKey = true;
  node->pendingMac.used = false;

  uint8_t keySequence = 0U;
  bool nwkSecurityEnabled = false;
  if (buildTransportKeyPsdu(node, node->pendingMac.psdu, &node->pendingMac.length,
                            &keySequence, &nwkSecurityEnabled)) {
    node->pendingMac.used = true;
    Serial.print("transport_key prepared short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" len=");
    Serial.print(node->pendingMac.length);
    Serial.print(" seq=");
    Serial.print(keySequence);
    Serial.print(" nwk_sec=");
    Serial.print(nwkSecurityEnabled ? "yes" : "no");
    Serial.print("\r\n");
  }
  return true;
}

bool nodeUsesParentPolling(const NodeEntry& node) {
  if (node.logicalType ==
      static_cast<uint8_t>(ZigbeeLogicalType::kEndDevice)) {
    return true;
  }
  if (node.logicalType == static_cast<uint8_t>(ZigbeeLogicalType::kRouter) ||
      node.logicalType ==
          static_cast<uint8_t>(ZigbeeLogicalType::kCoordinator)) {
    return false;
  }
  return (node.macCapabilityFlags & (1U << 3U)) == 0U;
}

bool maybeDeliverPendingDirect(NodeEntry* node, uint32_t nowMs,
                               bool immediateAfterAssoc) {
  if (node == nullptr || node->shortAddress == 0U ||
      nodeUsesParentPolling(*node) ||
      !(node->pending.used || node->pendingTransportKey ||
        node->pendingSecureRejoin || node->pendingSwitchKey ||
        node->pendingNwkResponse)) {
    return false;
  }

  if (!immediateAfterAssoc &&
      static_cast<uint32_t>(nowMs - node->lastDirectDeliverAttemptMs) <
          kRouterDirectDeliverRetryMs) {
    return false;
  }

  if (immediateAfterAssoc) {
    delayMicroseconds(kRouterPostAssocDeliverDelayUs);
  }

  node->lastDirectDeliverAttemptMs = nowMs;

  if (node->pendingNwkResponse && node->pendingMac.used) {
    bool sent = sendPsdu(node->pendingMac.psdu, node->pendingMac.length);
    if (!sent && lastMacTxLooksDeliveredButUnacked()) {
      sent = true;
      Serial.print("router_deliver soft_ok dst=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" ack=MISS\r\n");
    }
    if (sent) {
      node->pendingNwkResponse = false;
      node->pendingMac.used = false;
      node->pendingMac.length = 0U;
      pumpImmediateResponseWindow(kPollFollowUpListenBudgetUs);
    }
    Serial.print("router_deliver ");
    Serial.print(sent ? "OK" : "FAIL");
    Serial.print(" type=nwk_rsp dst=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print("\r\n");
    return sent;
  }

  const bool readyForSend =
      !node->pending.used ||
      node->pending.deliveryMode != kZigbeeApsDeliveryUnicast ||
      pendingApsAckSlotAvailable(*node, nowMs);
  if (!readyForSend) {
    return false;
  }

  const bool sent = sendPendingApsFrame(node);
  if (sent) {
    pumpImmediateResponseWindow(kPollFollowUpListenBudgetUs);
  }
  Serial.print("router_deliver ");
  Serial.print(sent ? "OK" : "FAIL");
  Serial.print(" type=aps dst=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print("\r\n");
  return sent;
}

bool queueNetworkKeyUpdateRollout() {
  if (!deriveAlternateNetworkKey()) {
    return false;
  }

  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    NodeEntry& node = g_nodes[i];
    if (!node.used || node.shortAddress == 0U || node.pendingAssociationResponse ||
        node.pendingTransportKey || node.pendingSwitchKey ||
        node.pendingSecureRejoin || node.pending.used ||
        node.currentNetworkKeySequence == 0U ||
        node.trustCenterState != TrustCenterNodeState::kJoined ||
        node.currentNetworkKeySequence == g_alternateNetworkKeySequence) {
      continue;
    }
    queuedAny = queuePendingTransportKey(&node, true) || queuedAny;
  }
  return queuedAny;
}

bool sendSwitchKey(NodeEntry* node) {
  if (node == nullptr || node->shortAddress == 0U || !g_haveAlternateNetworkKey ||
      node->currentNetworkKeySequence == 0U ||
      node->trustCenterState != TrustCenterNodeState::kAlternateKeyStaged) {
    return false;
  }

  uint8_t linkKey[16] = {0U};
  ZigbeePreconfiguredKeyMode keyMode = ZigbeePreconfiguredKeyMode::kNone;
  if (!resolveTrustCenterLinkKey(node, linkKey, &keyMode)) {
    return false;
  }
  node->preconfiguredKeyMode = keyMode;

  const uint8_t* currentKey = keyForSequence(node->currentNetworkKeySequence);
  if (currentKey == nullptr) {
    return false;
  }

  ZigbeeApsSwitchKey switchKey{};
  switchKey.valid = true;
  switchKey.keySequence = g_alternateNetworkKeySequence;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  ZigbeeApsSecurityHeader apsSecurity{};
  apsSecurity.valid = true;
  apsSecurity.securityControl = kZigbeeSecurityControlApsEncMic32;
  apsSecurity.frameCounter = g_apsTrustCenterFrameCounter++;
  apsSecurity.sourceIeee = kCoordinatorIeee;
  if (!ZigbeeSecurity::buildSecuredApsSwitchKeyCommand(
          switchKey, apsSecurity, linkKey, g_apsCounter++, apsFrame,
          &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = true;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  ZigbeeNwkSecurityHeader security{};
  security.valid = true;
  security.securityControl = kZigbeeSecurityControlNwkEncMic32;
  security.frameCounter = g_nwkSecurityFrameCounter++;
  security.sourceIeee = kCoordinatorIeee;
  security.keySequence = node->currentNetworkKeySequence;
  if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, currentKey, apsFrame,
                                            apsLength, nwkFrame, &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, psdu,
                                        &psduLength, false)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

