lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  const bool sent =
      sendApsFrameExtended(node->shortAddress, node->pending.deliveryMode,
                           node->pending.destinationGroup,
                           node->pending.destinationEndpoint,
                           node->pending.clusterId, node->pending.profileId,
                           node->pending.sourceEndpoint, node->pending.payload,
                           node->pending.payloadLength);
  if (sent) {
    node->pending.used = false;
    node->pending.payloadLength = 0U;
  }
  return sent;
}

bool queueActiveEndpointsRequest(NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoActiveEndpointsRequest(g_zdoSequence++,
                                                   node->shortAddress,
                                                   payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeZdoActiveEndpointsRequest,
                           kZigbeeProfileZdo, 0U, 0U, payload, payloadLength);
  if (queued) {
    markInterviewStage(node, NodeStage::kAwaitingActiveEndpoints);
  }
  return queued;
}

bool queueNodeDescriptorRequest(NodeEntry* node) {
  if (node == nullptr || node->shortAddress == 0U) {
    return false;
  }
  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoNodeDescriptorRequest(g_zdoSequence++,
                                                  node->shortAddress, payload,
                                                  &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeZdoNodeDescriptorRequest,
                           kZigbeeProfileZdo, 0U, 0U, payload, payloadLength);
  if (queued) {
    markInterviewStage(node, NodeStage::kAwaitingNodeDescriptor);
  }
  return queued;
}

bool queuePowerDescriptorRequest(NodeEntry* node) {
  if (node == nullptr || node->shortAddress == 0U) {
    return false;
  }
  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoPowerDescriptorRequest(g_zdoSequence++,
                                                   node->shortAddress, payload,
                                                   &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeZdoPowerDescriptorRequest,
                           kZigbeeProfileZdo, 0U, 0U, payload, payloadLength);
  if (queued) {
    markInterviewStage(node, NodeStage::kAwaitingPowerDescriptor);
  }
  return queued;
}

bool queueSimpleDescriptorRequest(NodeEntry* node, uint8_t endpoint) {
  if (node == nullptr || endpoint == 0U) {
    return false;
  }
  uint8_t payload[8] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoSimpleDescriptorRequest(g_zdoSequence++,
                                                    node->shortAddress, endpoint,
                                                    payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeZdoSimpleDescriptorRequest,
                           kZigbeeProfileZdo, 0U, 0U, payload, payloadLength);
  if (queued) {
    markInterviewStage(node, NodeStage::kAwaitingSimpleDescriptor);
  }
  return queued;
}

bool queueBasicReadRequest(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U) {
    return false;
  }
  static constexpr uint16_t kBasicReadBatch0[] = {0x0004U, 0x0005U};
  static constexpr uint16_t kBasicReadBatch1[] = {0x0000U, 0x0001U, 0x0002U,
                                                  0x0003U, 0x0007U};
  static constexpr uint16_t kBasicReadBatch2[] = {0x4000U, 0xFFFCU, 0xFFFDU};
  const uint16_t* attributes = nullptr;
  uint8_t attributeCount = 0U;
  switch (node->basicReadBatchIndex) {
    case 0U:
      attributes = kBasicReadBatch0;
      attributeCount =
          static_cast<uint8_t>(sizeof(kBasicReadBatch0) / sizeof(kBasicReadBatch0[0]));
      break;
    case 1U:
      attributes = kBasicReadBatch1;
      attributeCount =
          static_cast<uint8_t>(sizeof(kBasicReadBatch1) / sizeof(kBasicReadBatch1[0]));
      break;
    case 2U:
      attributes = kBasicReadBatch2;
      attributeCount =
          static_cast<uint8_t>(sizeof(kBasicReadBatch2) / sizeof(kBasicReadBatch2[0]));
      break;
    default:
      return false;
  }
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildReadAttributesRequest(
          attributes, attributeCount, g_zclSequence++, payload,
          &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterBasic,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    markInterviewStage(node, NodeStage::kAwaitingBasicRead);
  }
  return queued;
}

bool retryInterviewStage(NodeEntry* node) {
  if (node == nullptr || node->stageRetriesRemaining == 0U) {
    return false;
  }

  --node->stageRetriesRemaining;
  bool queued = false;
  switch (node->stage) {
    case NodeStage::kAwaitingNodeDescriptor:
      queued = queueNodeDescriptorRequest(node);
      break;
    case NodeStage::kAwaitingPowerDescriptor:
      queued = queuePowerDescriptorRequest(node);
      break;
    case NodeStage::kAwaitingActiveEndpoints:
      queued = queueActiveEndpointsRequest(node);
      break;
    case NodeStage::kAwaitingSimpleDescriptor:
      queued = queueSimpleDescriptorRequest(node, node->endpoint);
      break;
    case NodeStage::kAwaitingBasicRead:
      queued = queueBasicReadRequest(node);
      break;
    default:
      return false;
  }

  node->stageDeadlineMs = millis() + kInterviewRetryDelayMs;
  Serial.print("interview_retry short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" stage=");
  Serial.print(nodeStageName(node->stage));
  Serial.print(" rem=");
  Serial.print(node->stageRetriesRemaining);
  Serial.print(" queued=");
  Serial.print(queued ? "yes" : "no");
  Serial.print("\r\n");
  return queued;
}

