lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool queueHumidityConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsHumidity) {
    return false;
  }
  ZigbeeReportingConfiguration configuration{};
  configuration.used = true;
  configuration.clusterId = kZigbeeClusterRelativeHumidityMeasurement;
  configuration.attributeId = 0x0000U;
  configuration.dataType = ZigbeeZclDataType::kUint16;
  configuration.minimumIntervalSeconds = 10U;
  configuration.maximumIntervalSeconds = 120U;
  configuration.reportableChange = 100U;

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          &configuration, 1U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued = queuePendingApsFrame(
      node, kZigbeeClusterRelativeHumidityMeasurement,
      kZigbeeProfileHomeAutomation, node->endpoint, kCoordinatorEndpoint,
      payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterRelativeHumidityMeasurement;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueColorConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsColorControl) {
    return false;
  }

  ZigbeeReportingConfiguration configurations[3];
  memset(configurations, 0, sizeof(configurations));
  configurations[0].used = true;
  configurations[0].clusterId = kZigbeeClusterColorControl;
  configurations[0].attributeId = 0x0000U;
  configurations[0].dataType = ZigbeeZclDataType::kUint8;
  configurations[0].minimumIntervalSeconds = 1U;
  configurations[0].maximumIntervalSeconds = 30U;
  configurations[0].reportableChange = 4U;
  configurations[1].used = true;
  configurations[1].clusterId = kZigbeeClusterColorControl;
  configurations[1].attributeId = 0x0001U;
  configurations[1].dataType = ZigbeeZclDataType::kUint8;
  configurations[1].minimumIntervalSeconds = 1U;
  configurations[1].maximumIntervalSeconds = 30U;
  configurations[1].reportableChange = 4U;
  uint8_t configCount = 2U;
  if (node->supportsColorTemperature) {
    configurations[2].used = true;
    configurations[2].clusterId = kZigbeeClusterColorControl;
    configurations[2].attributeId = 0x0007U;
    configurations[2].dataType = ZigbeeZclDataType::kUint16;
    configurations[2].minimumIntervalSeconds = 1U;
    configurations[2].maximumIntervalSeconds = 30U;
    configurations[2].reportableChange = 8U;
    configCount = 3U;
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          configurations, configCount, g_zclSequence++, payload,
          &payloadLength)) {
    return false;
  }
  const bool queued = queuePendingApsFrame(
      node, kZigbeeClusterColorControl, kZigbeeProfileHomeAutomation,
      node->endpoint, kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterColorControl;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queuePowerConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U ||
      !node->supportsPowerConfiguration) {
    return false;
  }

  ZigbeeReportingConfiguration configurations[2];
  memset(configurations, 0, sizeof(configurations));
  configurations[0].used = true;
  configurations[0].clusterId = kZigbeeClusterPowerConfiguration;
  configurations[0].attributeId = 0x0020U;
  configurations[0].dataType = ZigbeeZclDataType::kUint8;
  configurations[0].minimumIntervalSeconds = 30U;
  configurations[0].maximumIntervalSeconds = 300U;
  configurations[0].reportableChange = 1U;
  configurations[1].used = true;
  configurations[1].clusterId = kZigbeeClusterPowerConfiguration;
  configurations[1].attributeId = 0x0021U;
  configurations[1].dataType = ZigbeeZclDataType::kUint8;
  configurations[1].minimumIntervalSeconds = 30U;
  configurations[1].maximumIntervalSeconds = 300U;
  configurations[1].reportableChange = 2U;

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          configurations, 2U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterPowerConfiguration,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterPowerConfiguration;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueReadReportingConfiguration(NodeEntry* node, uint16_t clusterId) {
  if (node == nullptr || node->endpoint == 0U) {
    return false;
  }

  ZigbeeReadReportingConfigurationRecord records[4];
  memset(records, 0, sizeof(records));
  uint8_t recordCount = 0U;
  switch (clusterId) {
    case kZigbeeClusterOnOff:
    case kZigbeeClusterLevelControl:
    case kZigbeeClusterTemperatureMeasurement:
    case kZigbeeClusterRelativeHumidityMeasurement:
      records[0].direction = 0U;
      records[0].attributeId = 0x0000U;
      recordCount = 1U;
      break;
    case kZigbeeClusterColorControl:
      records[0].direction = 0U;
      records[0].attributeId = 0x0000U;
      records[1].direction = 0U;
      records[1].attributeId = 0x0001U;
      recordCount = 2U;
      if (node->supportsColorTemperature) {
        records[2].direction = 0U;
        records[2].attributeId = 0x0007U;
        recordCount = 3U;
      }
      break;
    case kZigbeeClusterPowerConfiguration:
      records[0].direction = 0U;
      records[0].attributeId = 0x0020U;
      records[1].direction = 0U;
      records[1].attributeId = 0x0021U;
      recordCount = 2U;
      break;
    default:
      return false;
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildReadReportingConfigurationRequest(
          records, recordCount, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, clusterId, kZigbeeProfileHomeAutomation,
                           node->endpoint, kCoordinatorEndpoint, payload,
                           payloadLength);
  if (queued) {
    node->awaitingClusterId = clusterId;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool reportingConfigurationMatches(
    uint16_t clusterId,
    const ZigbeeReadReportingConfigurationResponseRecord* records,
    uint8_t recordCount) {
  if (records == nullptr) {
    return false;
  }

  switch (clusterId) {
    case kZigbeeClusterOnOff:
      return recordCount == 1U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0000U &&
             records[0].dataType == ZigbeeZclDataType::kBoolean &&
             records[0].minimumIntervalSeconds == 0U &&
             records[0].maximumIntervalSeconds == 60U &&
             records[0].reportableChange == 0U;
    case kZigbeeClusterLevelControl:
      return recordCount == 1U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0000U &&
             records[0].dataType == ZigbeeZclDataType::kUint8 &&
             records[0].minimumIntervalSeconds == 0U &&
             records[0].maximumIntervalSeconds == 60U &&
             records[0].reportableChange == 16U;
    case kZigbeeClusterTemperatureMeasurement:
      return recordCount == 1U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0000U &&
             records[0].dataType == ZigbeeZclDataType::kInt16 &&
             records[0].minimumIntervalSeconds == 5U &&
             records[0].maximumIntervalSeconds == 60U &&
             records[0].reportableChange == 25U;
    case kZigbeeClusterRelativeHumidityMeasurement:
      return recordCount == 1U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0000U &&
             records[0].dataType == ZigbeeZclDataType::kUint16 &&
             records[0].minimumIntervalSeconds == 10U &&
             records[0].maximumIntervalSeconds == 120U &&
             records[0].reportableChange == 100U;
    case kZigbeeClusterColorControl:
      if (recordCount != 2U && recordCount != 3U) {
        return false;
      }
      if (!(records[0].status == 0x00U && records[0].direction == 0U &&
            records[0].attributeId == 0x0000U &&
            records[0].dataType == ZigbeeZclDataType::kUint8 &&
            records[0].minimumIntervalSeconds == 1U &&
            records[0].maximumIntervalSeconds == 30U &&
            records[0].reportableChange == 4U &&
            records[1].status == 0x00U && records[1].direction == 0U &&
            records[1].attributeId == 0x0001U &&
            records[1].dataType == ZigbeeZclDataType::kUint8 &&
            records[1].minimumIntervalSeconds == 1U &&
            records[1].maximumIntervalSeconds == 30U &&
            records[1].reportableChange == 4U)) {
        return false;
      }
      if (recordCount == 3U) {
        return records[2].status == 0x00U && records[2].direction == 0U &&
               records[2].attributeId == 0x0007U &&
               records[2].dataType == ZigbeeZclDataType::kUint16 &&
               records[2].minimumIntervalSeconds == 1U &&
               records[2].maximumIntervalSeconds == 30U &&
               records[2].reportableChange == 8U;
      }
      return true;
    case kZigbeeClusterPowerConfiguration:
      return recordCount == 2U && records[0].status == 0x00U &&
             records[0].direction == 0U && records[0].attributeId == 0x0020U &&
             records[0].dataType == ZigbeeZclDataType::kUint8 &&
             records[0].minimumIntervalSeconds == 30U &&
             records[0].maximumIntervalSeconds == 300U &&
             records[0].reportableChange == 1U && records[1].status == 0x00U &&
             records[1].direction == 0U && records[1].attributeId == 0x0021U &&
             records[1].dataType == ZigbeeZclDataType::kUint8 &&
             records[1].minimumIntervalSeconds == 30U &&
             records[1].maximumIntervalSeconds == 300U &&
             records[1].reportableChange == 2U;
    default:
      return false;
  }
}

bool queueOnOffCommand(NodeEntry* node, uint8_t commandId) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsOnOff) {
    return false;
  }
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = commandId;
  if (!ZigbeeCodec::buildZclFrame(frame, nullptr, 0U, payload, &payloadLength)) {
    return false;
  }
  return queuePendingApsFrame(node, kZigbeeClusterOnOff,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

