lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool queueLevelMoveToLevel(NodeEntry* node, uint8_t level) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl) {
    return false;
  }

  const uint8_t commandPayload[] = {level, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandMoveToLevelWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterLevelControl,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueLevelStep(NodeEntry* node, bool increase, uint8_t stepSize) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(increase ? 0x00U : 0x01U), stepSize, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandStepWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterLevelControl,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueColorMoveToHueAndSaturation(NodeEntry* node, uint8_t hue,
                                      uint8_t saturation) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsColorControl) {
    return false;
  }

  const uint8_t commandPayload[] = {hue, saturation, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kColorControlCommandMoveToHueAndSaturation;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterColorControl,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueColorMoveToTemperature(NodeEntry* node,
                                 uint16_t colorTemperatureMireds) {
  if (node == nullptr || node->endpoint == 0U ||
      !node->supportsColorTemperature) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(colorTemperatureMireds & 0xFFU),
      static_cast<uint8_t>((colorTemperatureMireds >> 8U) & 0xFFU), 0x00U,
      0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kColorControlCommandMoveToColorTemperature;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterColorControl,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueIdentifyCommand(NodeEntry* node, uint16_t identifyTimeSeconds) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsIdentify) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(identifyTimeSeconds & 0xFFU),
      static_cast<uint8_t>((identifyTimeSeconds >> 8U) & 0xFFU)};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kIdentifyCommandIdentify;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterIdentify,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueIdentifyDiscoverAttributesExtended(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsIdentify) {
    return false;
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildDiscoverAttributesExtendedRequest(
          0x0000U, 8U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterIdentify,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueIdentifyWriteAttribute(NodeEntry* node, uint16_t identifyTimeSeconds,
                                 bool noResponse) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsIdentify) {
    return false;
  }

  ZigbeeWriteAttributeRecord record{};
  record.attributeId = 0x0000U;
  record.value.type = ZigbeeZclDataType::kUint16;
  record.value.data.u16 = identifyTimeSeconds;

