lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void applyReportedAttributeState(NodeEntry* node, uint16_t clusterId,
                                 const ZigbeeAttributeReportRecord* records,
                                 uint8_t recordCount) {
  if (node == nullptr || records == nullptr) {
    return;
  }
  for (uint8_t i = 0U; i < recordCount; ++i) {
    updateNodeAttributeState(node, clusterId, records[i].value,
                             records[i].attributeId);
  }
}

bool queueNextReportingStep(NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
  if (node->supportsOnOff && !node->onOffBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterOnOff);
  }
  if (node->supportsOnOff && !node->onOffReportingConfigured) {
    return queueOnOffConfigureReporting(node);
  }
  if (node->supportsLevelControl && !node->levelBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterLevelControl);
  }
  if (node->supportsLevelControl && !node->levelReportingConfigured) {
    return queueLevelConfigureReporting(node);
  }
  if (node->supportsColorControl && !node->colorBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterColorControl);
  }
  if (node->supportsColorControl && !node->colorReportingConfigured) {
    return queueColorConfigureReporting(node);
  }
  if (node->supportsTemperature && !node->temperatureBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterTemperatureMeasurement);
  }
  if (node->supportsTemperature && !node->temperatureReportingConfigured) {
    return queueTemperatureConfigureReporting(node);
  }
  if (node->supportsHumidity && !node->humidityBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterRelativeHumidityMeasurement);
  }
  if (node->supportsHumidity && !node->humidityReportingConfigured) {
    return queueHumidityConfigureReporting(node);
  }
  if (node->supportsPowerConfiguration && !node->powerBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterPowerConfiguration);
  }
  if (node->supportsPowerConfiguration && !node->powerReportingConfigured) {
    return queuePowerConfigureReporting(node);
  }
  return false;
}

void printAttributeValue(const ZigbeeAttributeValue& value) {
  switch (value.type) {
    case ZigbeeZclDataType::kBoolean:
      Serial.print(value.data.boolValue ? "true" : "false");
      break;
    case ZigbeeZclDataType::kBitmap8:
    case ZigbeeZclDataType::kUint8:
      Serial.print(value.data.u8);
      break;
    case ZigbeeZclDataType::kBitmap16:
    case ZigbeeZclDataType::kUint16:
      Serial.print(value.data.u16);
      break;
    case ZigbeeZclDataType::kInt16:
      Serial.print(value.data.i16);
      break;
    case ZigbeeZclDataType::kUint32:
      Serial.print(value.data.u32);
      break;
    case ZigbeeZclDataType::kCharString:
      for (uint8_t i = 0U; i < value.stringLength; ++i) {
        Serial.print(value.stringValue[i]);
      }
      break;
    default:
      Serial.print("unsupported");
      break;
  }
}

void listNodes() {
  Serial.print("nodes\r\n");
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used) {
      continue;
    }
    Serial.print(" slot=");
    Serial.print(i);
    Serial.print(" ieee=0x");
    Serial.print(static_cast<uint32_t>(g_nodes[i].ieeeAddress >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(g_nodes[i].ieeeAddress & 0xFFFFFFFFUL), HEX);
    Serial.print(" short=0x");
    Serial.print(g_nodes[i].shortAddress, HEX);
    Serial.print(" ep=");
    Serial.print(g_nodes[i].endpoint);
    Serial.print(" dev=0x");
    Serial.print(g_nodes[i].deviceId, HEX);
    Serial.print(" onoff=");
    Serial.print(g_nodes[i].supportsOnOff ? "yes" : "no");
    Serial.print(" level=");
    Serial.print(g_nodes[i].supportsLevelControl ? "yes" : "no");
    Serial.print(" identify=");
    if (g_nodes[i].supportsIdentify) {
      if (g_nodes[i].haveIdentifyTime) {
        Serial.print(g_nodes[i].identifyTimeSeconds);
      } else {
        Serial.print("?");
      }
    } else {
      Serial.print("no");
    }
    Serial.print(" temp=");
    if (g_nodes[i].supportsTemperature) {
      if (g_nodes[i].haveTemperatureState) {
        printCentiDegrees(g_nodes[i].temperatureCentiDegrees);
        Serial.print("C");
      } else {
        Serial.print("?");
      }
    } else {
      Serial.print("no");
    }
    Serial.print(" hum=");
    if (g_nodes[i].supportsHumidity) {
      if (g_nodes[i].haveHumidityState) {
        Serial.print(g_nodes[i].humidityCentiPercent / 100U);
        Serial.print(".");
        const uint8_t fraction =
            static_cast<uint8_t>(g_nodes[i].humidityCentiPercent % 100U);
        if (fraction < 10U) {
          Serial.print("0");
        }
        Serial.print(fraction);
        Serial.print("%");
      } else {
        Serial.print("?");
      }
    } else {
      Serial.print("no");
    }
    Serial.print(" color=");
    if (g_nodes[i].supportsColorControl) {
      if (g_nodes[i].haveCurrentHue) {
        Serial.print("h=");
        Serial.print(g_nodes[i].currentHue);
      } else {
        Serial.print("h=?");
      }
      Serial.print("/");
      if (g_nodes[i].haveCurrentSaturation) {
        Serial.print("s=");
        Serial.print(g_nodes[i].currentSaturation);
      } else {
        Serial.print("s=?");
      }
      if (g_nodes[i].supportsColorTemperature) {
        Serial.print("/");
        if (g_nodes[i].haveColorTemperature) {
          Serial.print("ct=");
          Serial.print(g_nodes[i].colorTemperatureMireds);
        } else {
          Serial.print("ct=?");
        }
      }
    } else {
      Serial.print("no");
    }
    Serial.print(" batt=");
    if (g_nodes[i].haveBatteryVoltage || g_nodes[i].haveBatteryPercentage) {
      if (g_nodes[i].haveBatteryVoltage) {
        Serial.print(g_nodes[i].batteryVoltageDecivolts / 10);
        Serial.print(".");
        Serial.print(g_nodes[i].batteryVoltageDecivolts % 10);
        Serial.print("V");
      } else {
        Serial.print("?");
      }
      Serial.print("/");
      if (g_nodes[i].haveBatteryPercentage) {
        Serial.print(g_nodes[i].batteryPercentageRemainingHalf / 2);
        if ((g_nodes[i].batteryPercentageRemainingHalf & 0x01U) != 0U) {
          Serial.print(".5");
        }
        Serial.print("%");
      } else {
        Serial.print("?");
      }
    } else {
      Serial.print("?");
    }
    Serial.print(" group=");
    Serial.print(g_nodes[i].demoGroupConfigured ? "0x1001" : "no");
    Serial.print(" lk=");
    Serial.print(
        ZigbeeCommissioning::keyModeName(g_nodes[i].preconfiguredKeyMode));
    Serial.print(" tc=");
    Serial.print(trustCenterStateName(g_nodes[i].trustCenterState));
    Serial.print(" nwk_seq=");
    Serial.print(g_nodes[i].currentNetworkKeySequence);
    Serial.print(" nwk_sec=");
    Serial.print(g_nodes[i].secureNwkSeen ? "yes" : "no");
    Serial.print(" timeout=");
    if (g_nodes[i].endDeviceTimeoutNegotiated) {
      Serial.print("0x");
      Serial.print(g_nodes[i].endDeviceTimeoutIndex, HEX);
    } else {
      Serial.print("no");
    }
    Serial.print(" pending=");
    Serial.print((g_nodes[i].pending.used ||
                  g_nodes[i].pendingAssociationResponse ||
                  g_nodes[i].pendingTransportKey ||
                  g_nodes[i].pendingSwitchKey ||
                  g_nodes[i].pendingSecureRejoin ||
                  nodeHasPendingApsAck(g_nodes[i]))
                     ? "yes"
                     : "no");
    Serial.print(" rptv=");
    if (g_nodes[i].supportsOnOff) {
      Serial.print(g_nodes[i].onOffReportingVerified ? "O" : "o");
    }
    if (g_nodes[i].supportsLevelControl) {
      Serial.print(g_nodes[i].levelReportingVerified ? "L" : "l");
    }
    if (g_nodes[i].supportsTemperature) {
      Serial.print(g_nodes[i].temperatureReportingVerified ? "T" : "t");
    }
    if (g_nodes[i].supportsHumidity) {
      Serial.print(g_nodes[i].humidityReportingVerified ? "H" : "h");
    }
    if (g_nodes[i].supportsColorControl) {
      Serial.print(g_nodes[i].colorReportingVerified ? "C" : "c");
    }
    if (g_nodes[i].supportsPowerConfiguration) {
      Serial.print(g_nodes[i].powerReportingVerified ? "P" : "p");
    }
    Serial.print(" state=");
    if (g_nodes[i].haveOnOffState) {
      Serial.print(g_nodes[i].onOffState ? "ON" : "OFF");
    } else {
      Serial.print("?");
    }
    if (g_nodes[i].supportsLevelControl) {
      Serial.print(" lvl=");
      if (g_nodes[i].haveLevelState) {
      Serial.print(g_nodes[i].levelState);
      } else {
        Serial.print("?");
      }
    }
    if (g_nodes[i].basicManufacturerName[0] != '\0' ||
        g_nodes[i].basicModelIdentifier[0] != '\0') {
      Serial.print(" basic=");
      Serial.print(g_nodes[i].basicManufacturerName[0] != '\0'
                       ? g_nodes[i].basicManufacturerName
                       : "?");
      Serial.print("/");
      Serial.print(g_nodes[i].basicModelIdentifier[0] != '\0'
                       ? g_nodes[i].basicModelIdentifier
                       : "?");
    }
    if (g_nodes[i].basicSwBuildId[0] != '\0') {
      Serial.print(" sw=");
      Serial.print(g_nodes[i].basicSwBuildId);
    }
    if (g_nodes[i].haveBasicPowerSource) {
      Serial.print(" psrc=0x");
      Serial.print(g_nodes[i].basicPowerSource, HEX);
    }
    Serial.print("\r\n");
  }
}

