lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
    node->endpoint = view.endpoint;
    node->profileId = view.profileId;
    node->deviceId = view.deviceId;
    node->supportsOnOff = false;
    node->supportsLevelControl = false;
    node->supportsIdentify = false;
    node->supportsTemperature = false;
    node->supportsHumidity = false;
    node->supportsColorControl = false;
    node->supportsColorTemperature = false;
    node->supportsPowerConfiguration = false;
    node->haveIdentifyTime = false;
    node->identifyTimeSeconds = 0U;
    node->onOffBindingConfigured = false;
    node->levelBindingConfigured = false;
    node->temperatureBindingConfigured = false;
    node->humidityBindingConfigured = false;
    node->colorBindingConfigured = false;
    node->powerBindingConfigured = false;
    node->onOffReportingConfigured = false;
    node->levelReportingConfigured = false;
    node->temperatureReportingConfigured = false;
    node->humidityReportingConfigured = false;
    node->colorReportingConfigured = false;
    node->powerReportingConfigured = false;
    node->onOffReportingVerified = false;
    node->levelReportingVerified = false;
    node->temperatureReportingVerified = false;
    node->humidityReportingVerified = false;
    node->colorReportingVerified = false;
    node->powerReportingVerified = false;
    node->awaitingBindResponse = false;
    node->awaitingClusterId = 0U;
    node->demoGroupConfigured = false;
    for (uint8_t i = 0U; i < view.inputClusterCount; ++i) {
      if (view.inputClusters[i] == kZigbeeClusterOnOff) {
        node->supportsOnOff = true;
      } else if (view.inputClusters[i] == kZigbeeClusterLevelControl) {
        node->supportsLevelControl = true;
      } else if (view.inputClusters[i] == kZigbeeClusterIdentify) {
        node->supportsIdentify = true;
      } else if (view.inputClusters[i] == kZigbeeClusterTemperatureMeasurement) {
        node->supportsTemperature = true;
      } else if (view.inputClusters[i] ==
                 kZigbeeClusterRelativeHumidityMeasurement) {
        node->supportsHumidity = true;
      } else if (view.inputClusters[i] == kZigbeeClusterColorControl) {
        node->supportsColorControl = true;
      } else if (view.inputClusters[i] == kZigbeeClusterPowerConfiguration) {
        node->supportsPowerConfiguration = true;
      }
    }
    node->supportsColorTemperature =
        (node->deviceId == kZigbeeDeviceIdExtendedColorLight);

    Serial.print("simple_desc short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" ep=");
    Serial.print(node->endpoint);
    Serial.print(" profile=0x");
    Serial.print(node->profileId, HEX);
    Serial.print(" device=0x");
    Serial.print(node->deviceId, HEX);
    Serial.print(" onoff=");
    Serial.print(node->supportsOnOff ? "yes" : "no");
    Serial.print(" identify=");
    Serial.print(node->supportsIdentify ? "yes" : "no");
    Serial.print(" level=");
    Serial.print(node->supportsLevelControl ? "yes" : "no");
    Serial.print(" temp=");
    Serial.print(node->supportsTemperature ? "yes" : "no");
    Serial.print(" hum=");
    Serial.print(node->supportsHumidity ? "yes" : "no");
    Serial.print(" color=");
    Serial.print(node->supportsColorControl ? "yes" : "no");
    Serial.print(" ct=");
    Serial.print(node->supportsColorTemperature ? "yes" : "no");
    Serial.print("\r\n");

    node->basicReadBatchIndex = 0U;
    if (!queueBasicReadRequest(node)) {
      node->stage = NodeStage::kReady;
    }
  }
}

void handleHaFrame(NodeEntry* node, const ZigbeeApsDataFrame& aps) {
  if (node == nullptr) {
    return;
  }

  ZigbeeZclFrame zcl{};
  if (!ZigbeeCodec::parseZclFrame(aps.payload, aps.payloadLength, &zcl) ||
      !zcl.valid) {
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == 0x01U) {
    ZigbeeReadAttributeRecord records[8];
    uint8_t recordCount = 0U;
    if (!ZigbeeCodec::parseReadAttributesResponse(
            zcl.payload, zcl.payloadLength, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }
    applyReadAttributeState(node, aps.clusterId, records, recordCount);

    Serial.print("read_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" ");
    for (uint8_t i = 0U; i < recordCount; ++i) {
      Serial.print("attr=0x");
      Serial.print(records[i].attributeId, HEX);
      Serial.print(":");
      if (records[i].status == 0x00U) {
        printAttributeValue(records[i].value);
      } else {
        Serial.print("status=0x");
        Serial.print(records[i].status, HEX);
      }
      Serial.print(" ");
    }
    Serial.print("\r\n");

    if (aps.clusterId == kZigbeeClusterBasic) {
      if (node->basicReadBatchIndex < 2U) {
        ++node->basicReadBatchIndex;
        if (!queueBasicReadRequest(node)) {
          node->basicRead = true;
          if (!queueNextReportingStep(node)) {
            node->stage = NodeStage::kReady;
          }
        }
      } else {
        node->basicRead = true;
        if (!queueNextReportingStep(node)) {
          node->stage = NodeStage::kReady;
        }
      }
    }
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandWriteAttributesResponse) {
    ZigbeeWriteAttributeStatusRecord records[8];
    uint8_t recordCount = 0U;
    if (!ZigbeeCodec::parseWriteAttributesResponse(
            zcl.payload, zcl.payloadLength, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }

    Serial.print("write_attr_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    for (uint8_t i = 0U; i < recordCount; ++i) {
      Serial.print(" status=0x");
      Serial.print(records[i].status, HEX);
      if (records[i].attributeId != 0U || records[i].status != 0x00U) {
        Serial.print(" attr=0x");
        Serial.print(records[i].attributeId, HEX);
      }
    }
    Serial.print("\r\n");
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandDiscoverAttributesExtendedResponse) {
    ZigbeeDiscoveredExtendedAttributeRecord records[8];
    uint8_t recordCount = 0U;
    bool discoveryComplete = false;
    if (!ZigbeeCodec::parseDiscoverAttributesExtendedResponse(
            zcl.payload, zcl.payloadLength, &discoveryComplete, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }

