lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Coordinator/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
    Serial.print("remote_onoff_cmd short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" device=0x");
    Serial.print(node->deviceId, HEX);
    Serial.print(" cmd=");
    Serial.print(commandName);
    Serial.print("\r\n");

    if (isRemoteControllerDevice(*node)) {
      NodeEntry* target = firstOnOffNode();
      if (target != nullptr) {
        const bool forwarded = queueOnOffCommand(target, zcl.commandId);
        Serial.print("remote_onoff_forward short=0x");
        Serial.print(target->shortAddress, HEX);
        Serial.print(" queued=");
        Serial.print(forwarded ? "yes" : "no");
        Serial.print("\r\n");
      }
    }
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandReportAttributes) {
    ZigbeeAttributeReportRecord records[8];
    uint8_t recordCount = 0U;
    if (!ZigbeeCodec::parseAttributeReport(
            zcl.payload, zcl.payloadLength, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }
    applyReportedAttributeState(node, aps.clusterId, records, recordCount);

    Serial.print("report short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" ");
    for (uint8_t i = 0U; i < recordCount; ++i) {
      Serial.print("attr=0x");
      Serial.print(records[i].attributeId, HEX);
      Serial.print(":");
      printAttributeValue(records[i].value);
      Serial.print(" ");
    }
    Serial.print("\r\n");
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandDefaultResponse && zcl.payloadLength >= 2U) {
    Serial.print("default_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cmd=0x");
    Serial.print(zcl.payload[0], HEX);
    Serial.print(" status=0x");
    Serial.print(zcl.payload[1], HEX);
    Serial.print("\r\n");
  }
}

void processIncomingFrame(const ZigbeeFrame& frame) {
  ZigbeeMacFrame mac{};
  if (!ZigbeeCodec::parseMacFrame(frame.psdu, frame.length, &mac) || !mac.valid) {
    return;
  }

  if (mac.frameType == ZigbeeMacFrameType::kCommand) {
    if (mac.commandId == kZigbeeMacCommandBeaconRequest) {
      Serial.print("beacon_req seq=0x");
      Serial.print(mac.sequence, HEX);
      Serial.print(" src_mode=");
      Serial.print(static_cast<uint8_t>(mac.source.mode));
      Serial.print("\r\n");
      const bool sent = sendBeacon();
      Serial.print("beacon_rsp sent=");
      Serial.print(sent ? "yes" : "no");
      Serial.print("\r\n");
      if (sent) {
        pumpImmediateResponseWindow(20000U);
      }
      return;
    }

    ZigbeeMacOrphanNotificationView orphan{};
    if (ZigbeeCodec::parseOrphanNotification(frame.psdu, frame.length,
                                             &orphan)) {
      handleOrphanNotification(orphan, frame.rssiDbm);
      return;
    }

    ZigbeeMacAssociationRequestView association{};
    if (ZigbeeCodec::parseAssociationRequest(frame.psdu, frame.length,
                                             &association)) {
      handleAssociationRequest(association, frame.rssiDbm);
      pumpImmediateResponseWindow(kPollFollowUpListenBudgetUs);
      return;
    }

    if (mac.commandId == kZigbeeMacCommandDataRequest &&
        mac.destination.mode == ZigbeeMacAddressMode::kShort &&
        mac.destination.panId == kPanId &&
        mac.destination.shortAddress == kCoordinatorShort) {
      handleDataRequest(mac);
      return;
    }
    return;
  }

  ZigbeeDataFrameView macData{};
  if (!ZigbeeRadio::parseDataFrameShort(frame.psdu, frame.length, &macData) ||
      !macData.valid || macData.panId != kPanId ||
      macData.destinationShort != kCoordinatorShort) {
    return;
  }

  NodeEntry* node = findNodeByShort(macData.sourceShort);
  if (node == nullptr) {
    return;
  }
  node->lastSeenMs = millis();

  ZigbeeNetworkFrame nwk{};
  ZigbeeNwkSecurityHeader security{};
  uint8_t decryptedPayload[127] = {0U};
  uint8_t decryptedPayloadLength = 0U;
  const uint8_t expectedKeySequence =
      (node->currentNetworkKeySequence != 0U) ? node->currentNetworkKeySequence
                                              : g_activeNetworkKeySequence;
  const uint8_t* expectedKey = keyForSequence(expectedKeySequence);
  bool nwkValid = (expectedKey != nullptr) &&
                  ZigbeeSecurity::parseSecuredNwkFrame(
                      macData.payload, macData.payloadLength, expectedKey, &nwk,
                      &security, decryptedPayload, &decryptedPayloadLength,
                      node->ieeeAddress);
  if (nwkValid &&
      (!security.valid || security.sourceIeee != node->ieeeAddress ||
       security.keySequence != expectedKeySequence ||
       security.frameCounter <= node->lastInboundSecurityFrameCounter)) {
    return;
  }
  if (!nwkValid) {
    nwkValid =
        ZigbeeCodec::parseNwkFrame(macData.payload, macData.payloadLength, &nwk);
  }
  if (!nwkValid || !nwk.valid || nwk.destinationShort != kCoordinatorShort) {
    return;
  }
  if (security.valid) {
    node->secureNwkSeen = true;
    node->lastInboundSecurityFrameCounter = security.frameCounter;
  }

  if (nwk.frameType == ZigbeeNwkFrameType::kCommand) {
    ZigbeeNwkRejoinRequest rejoinRequest{};
    if (security.valid &&
        ZigbeeCodec::parseNwkRejoinRequestCommand(nwk.payload, nwk.payloadLength,
                                                  &rejoinRequest) &&
        rejoinRequest.valid) {
      handleNwkRejoinRequest(node, rejoinRequest);
      return;
    }

    ZigbeeNwkEndDeviceTimeoutRequest timeoutRequest{};
    if (security.valid &&
        ZigbeeCodec::parseNwkEndDeviceTimeoutRequestCommand(
            nwk.payload, nwk.payloadLength, &timeoutRequest) &&
        timeoutRequest.valid) {
      handleEndDeviceTimeoutRequest(node, timeoutRequest);
      return;
    }
    return;
  }

  ZigbeeApsDataFrame aps{};
  ZigbeeApsAcknowledgementFrame ack{};
  if (ZigbeeCodec::parseApsAcknowledgementFrame(nwk.payload, nwk.payloadLength,
                                                &ack) &&
      ack.valid) {
    uint8_t ackSlot = 0U;
    if (findPendingApsAckSlot(*node, ack, &ackSlot)) {
      Serial.print("aps_ack short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" ctr=0x");
      Serial.print(ack.counter, HEX);
      Serial.print(" cluster=0x");
      Serial.print(ack.clusterId, HEX);
      Serial.print("\r\n");
      clearPendingApsAckSlot(node, ackSlot);
    }
    return;
  }
  if (!ZigbeeCodec::parseApsDataFrame(nwk.payload, nwk.payloadLength, &aps) ||
      !aps.valid) {
    return;
  }

  const uint32_t nowMs = millis();
  const bool duplicateAps = isRecentInboundApsDuplicate(node, aps, nowMs);

  if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
    (void)sendApsAcknowledgement(node, aps);
  }

